title: Detect SndVol.exe spawning 
description: Detects the execution of SndVol.exe (injected process) with children processes whoami.exe / ipconfig.exe
author: RussianPanda
date: 2023-05/23
tags:
    - ad.0043

logsource:
  category: process_creation
  product: windowsssshh
  service: sysmonsss

detection:
  selection:
    ParentImage|endswith: '\SndVol.exe'
  selection1:
    Image|endswith: 
        - '\ipconfig.exe'
        - '\whoami.exe'
        - '\schtasks.exe'
  condition: selection and selection1 
falsepositives:
    - Unknown  
level: medium
